Revit.AnalysisDisplay.PointAnalysisDisplay.#ctor(Autodesk.Revit.DB.View,Analysis.PointData,System.String,System.String,System.Type)
Create a Point Analysis Display in the current view
view:
data:
resultsName:
description:
unitType:

Revit.AnalysisDisplay.PointAnalysisDisplay.InternalSetSpatialFieldValues(Analysis.IStructuredData{Autodesk.DesignScript.Geometry.Point,System.Double},System.Collections.Generic.List{System.Int32}@,System.String,System.String,System.Type)
Set the spatial field values for the current spatial field primitive.  The two
input sequences should be of the same length.
data:
primitiveIds:
schemaName:
description:
unitType: